{
    "education": {
        "id":"Education",
        "type":"list",
        "body":{
            "2016-2018":{
                "Qualification":"ND: Mathematical Technology",
                "Institude":"Cape Peninsula University of Technology",
                "Place":"Bellville SA",
                "Status":"Complete"
            },
            "2012-2013":{
                "Qualification":"BSC: Financial Mathematics",
                "Institude":"Stellenbosch University",
                "Place":"Stellenbosch SA",
                "Status":"Incomplete"
            },
            "2008-2011":{
                "Qualification":"BSC: Mathematics, Physics, and Computer Science",
                "Institude":"National University of Lesotho",
                "Place":"Roma Lesotho",
                "Status":"Incomplete"
            },
            "2006-2007":{
                "Qualification":"COSC",
                "Institude":"Sacred Heart High School",
                "Place":"St. Monica Lesotho",
                "Status":"Complete"
            },
            "2003-2005":{
                "Qualification":"Junior Certificate",
                "Institude":"National University of Lesotho International School",
                "Place":"Roma Lesotho",
                "Status":"Complete"
            },
            "1996-2002":{
                "Qualification":"PSLE",
                "Institude":"Morija English Medium School",
                "Place":"Morija Lesotho",
                "Status":"Complete"
            }
        }
    },
    "employment":{
        "id":"Employment",
        "type":"list",
        "body":{
            "Camara":{
                "Period":[2007,2009],
                "Title": "Lab Technician",
                "Description":"Refurbish donated computers and install Ubuntu operating system in them."
            },
            "Teflo Contractors":{
                "Period":[2011, 2014, 2015, 2019],
                "Title": "Project Manager",
                "Description":"Manage construction projects of Teflo Contractors. Specifically Rural Water Supply and Sanitation projects in Lesotho."
            },
            "CPUT":{
                "Period":[2018],
                "Title": "Library Assistant",
                "Description":"Assist with Check-in/out process of books. Assist students at Help Desk. Keep library organized and clean."
            },
            "Numeric":{
                "Period":[2018],
                "Title": "Mathematics Coach",
                "Description":"Coach Mathematics to grade 7 students of Merry Dale Primary School in Mitchell's Plain."
            },
            "Eighty20":{
                "Period":[2018,2019],
                "Title": "Junior ETL Developer (Internship)",
                "Description":"Extract, Transform and Load data from survey files to Eighty20's data portal."
            },
            "Montsa Construction":{
                "Period":[2020,2021,2022],
                "Title": "Managing Director",
                "Description":"Manage and direct the sustainability of Montsa Construction (Pty) Ltd."
            }
        }
    },
    "cover_letter":{
        "id":"Cover letter",
        "type":"doc",
        "body":{
            "p1":"I would like to express my interest for the vacant position in your company. Having committed hundreds to thousands lines of code to GitHub,  I am assertive in typing on the keyboard and can stare at the monitor for hours and hours typing and deleting words that will, at the end of the day, add code on GitHub. I have no fear in deleting what I typed if it proves useless and acknowledge that all code is garbage. The latter may rhyme because it's true, but in all honestly I do not know what I am doing and as an employee, my job is to adapt to the employers environment and help best way I can as quickly as possible.",
            "p2":"Having used software such as SAS, Mat lab, JupyterLab, RStudio, PostgreSQL, Firebase, Windows98, programming languages that include Python, R, JavaScript, CSS, and editors in the likes of Notepad++, Sublime and VSCode, I am very very very decisive in data analysis and also have an eye for aesthetics when developing functional web applications. From a card game like Hearts, to a Rubik algorithm collector like cfop-algorithms, to an API hosted on GitHub pages that serves as a CMS for this portfolio, I try much as I can to diversify code I commit and I always track my edits with the Global Information Tracker. Try me, and I will help alleviate the stress of realising your ideas.",
            "p3":"I greatly appreciate your time and consideration of my candidacy in your organization.",
            "p4":"Sincerely",
            "p5":"Letele Motebang"
        }
    }
}