{
    "winlose": {
        "title": "A win-lose lose-win situation",
        "body":{
            "p1": "Accept rejection, embrace dislikes, and view success with a contemptful smile.",
            "p2": "Why view success with a contemptful smile? Because its outcome can be futile. It may help in seeing the true potential of a process, but what's there to gain in 'seeing' only the achievable? If you experience success, be worried. Ask your self questions such as: “Why did I not fail?”, “Where did I go right?”, “How lucky was I?”. Flip the win to a lose. By doing so, not only will you see criticism as positive, but you will also disdain approbation, and therefore shield success from getting in your head.",
            "p3":"Why accept rejection and embrace dislikes? Because it advocates sobriety. It maybe depressing in seeing the process as impractical, but what's there not to gain in depression? You have failed dismally, embrace the failure. As terrible as the situation might be, the reality is that you are merely experiencing sobriety, and depression is only helping you see the situation crystal clear. Flip the lose to a win situation. With a sober state of mind, your inspiration is to idealize a more creative and less erroneous solution.",
            "p4":"At the end of the turmoil, its all really about excitement. Positive excitement is appealing, but it might falsely accredit the success of a process with its effectiveness rather than its luck. Negative excitement is depressing, and depression bad as it sounds, advocates sobriety, a very useful tool in developing ideas."
        } 
    },
    "deja_vu":{
        "title":"Déjà vu",
        "body":{
            "p1": " Its not in one's lifetime that one becomes a musician - Moses Taiwa Molelekwa",
            "p2":"Moses was a profound South African pianist who believed in reincanation, and in the qoute, he references Bheki Mseleku and is convinced that Bheki's talents where sharpened from a different lifetime. If you find jazz boring, then too bad man, or woman, or other. If not, listen (again if you have) to Bheki Mseleku's Celebration studio album and maybe you will get closer to the source, and catch a nostalgic feeling. It was only then, when I caught that feeling, that I understood what Moses was on about.",
            "p3":"  We are all told that hell exists, and that hell is a place where fire can never burn out. We are told that in hell, we will burn, but not die. The sun is scotching hot. The Sun's fire never burns out. The Sun is round like a planet. The Sun has all characteristics of hell. Therefore the Sun is hell. Misconception: There is no life in the Sun. In every celestial body, there is conciousness, and with conciousness, life exists. Call it the soul, or energy, or life,  what we know is that on Earth, conciousness is contained in an animal's or plant's body. And our senses and intelligence will only be limited to Earth and its environment. So just because there are no plants or animals in a celestial body, does not necessarily mean there is no concious presence in that body.",
            "p4":"Reincanation and the planetary system: When we die, our conciousness can only go to either, Venus, Earth, or Mars. The designation of our conciousness is dictated by aggregates of our actions while on Earth. If negative, we go to Venus, closer to hell, I mean closer to the Sun. On Venus you have a chance to repend, wbhich will be hotter, but with a second chance. If neutral, we stay on Earth, and try again, which will be more difficult as the population of Earth increases yearly, creating more unemployment and inflation. If positive, job well done, lets live in Mars. Mars, where there is no money, no religious denominations, no crazy demonstration (democracy) developed by politicians, no countries and continents. Basically no factors fueled with hate and jealousy, that aim to discriminate and divide conciousness.",
            "p5":" Where is the déjà vu? Its in the to and fro. In my previous lifetime I might have behaved in Venus, or misbehaved in Mars, or did nothing on Earth. Either route, I was reincanated with the skills I had acquired. So I think it wise to focus rather on aggregates of actions we make on the concious containers around us, rather that feeding desires of our own container. Like a famous man once said, 'Do unto others what you want done unto you'."
        }
    },
    "spagetti_code":{
        "title":"Spagetti code",
        "body":{
            "p1":" Spagetti code has no pattern. Its  unique to the author and shows how ingenious the author is. Unfortunatly readers can't fully understand the logic behind the code because of its uniqueness and will always ask what the for loop in the if block does to the while condition. Readers will then try to give alternative solutions, which is where the arguments of code logic often begins.The solution has to declare what it solves, not how what is solved. You want to add 2 to each item, and not tell us you itereted through all items and added 2 on each item using the item's index value to identify its uniqueness, and ingenious approach indeed.",
            "p2":"In desparate times, we turn to regex, and come up with the following regex pattern |...| which has to identify the following characters ... as valid. If it validates true we forget about regex. After a month we come back for code review to find |...|,and ask the famous 'what the ....?' question. Luckily regex has documentaion explaining what |...| matches and our question is answered. Spagetti code is like regex, only its documentation is comments (if available) in its code. Comments that will not guide but misguide the reader to the wrong conclusions.",
            "p3":"Solution? Declarative programming. Declarative programming addresses what should be done over how what should be done. And because its declarative, it somehow becomes an intuitive solution which will be understood by readers as the right approach in solving the problem. It also eliminates the need for adding comments that add more confusion as the style is self descriptive."
        }
    }
}